In [15]:
import pandas as pd

In [17]:
air_quality = pd.read_csv("Air_quality_no2.csv")
air_quality

                 datetime  station_antwerp  station_paris  station_london
0     2019-05-07 02:00:00              NaN            NaN            23.0
1     2019-05-07 03:00:00             50.5           25.0            19.0
2     2019-05-07 04:00:00             45.0           27.7            19.0
3     2019-05-07 05:00:00              NaN           50.4            16.0
4     2019-05-07 06:00:00              NaN           61.9             NaN
...                   ...              ...            ...             ...
1030  2019-06-20 22:00:00              NaN           21.4             NaN
1031  2019-06-20 23:00:00              NaN           24.9             NaN
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN

[1035 rows x 4 columns]

In [18]:
air_quality.head(9)

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00              NaN            NaN            23.0
1  2019-05-07 03:00:00             50.5           25.0            19.0
2  2019-05-07 04:00:00             45.0           27.7            19.0
3  2019-05-07 05:00:00              NaN           50.4            16.0
4  2019-05-07 06:00:00              NaN           61.9             NaN
5  2019-05-07 07:00:00              NaN           72.4            26.0
6  2019-05-07 08:00:00              NaN           77.7            32.0
7  2019-05-07 09:00:00              NaN           67.9            32.0
8  2019-05-07 10:00:00              NaN           56.0            28.0

In [19]:
air_quality.dtypes

datetime            object
station_antwerp    float64
station_paris      float64
station_london     float64
dtype: object

In [20]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (3.1.4)
Requirement already satisfied: et-xmlfile in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [22]:
air_quality.to_excel("Air.xlsx", sheet_name="Air_quality", index=False)

In [24]:
xcel = pd.read_excel('Air.xlsx')
xcel

                 datetime  station_antwerp  station_paris  station_london
0     2019-05-07 02:00:00              NaN            NaN            23.0
1     2019-05-07 03:00:00             50.5           25.0            19.0
2     2019-05-07 04:00:00             45.0           27.7            19.0
3     2019-05-07 05:00:00              NaN           50.4            16.0
4     2019-05-07 06:00:00              NaN           61.9             NaN
...                   ...              ...            ...             ...
1030  2019-06-20 22:00:00              NaN           21.4             NaN
1031  2019-06-20 23:00:00              NaN           24.9             NaN
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN

[1035 rows x 4 columns]

In [25]:
air_quality.describe

<bound method NDFrame.describe of                  datetime  station_antwerp  station_paris  station_london
0     2019-05-07 02:00:00              NaN            NaN            23.0
1     2019-05-07 03:00:00             50.5           25.0            19.0
2     2019-05-07 04:00:00             45.0           27.7            19.0
3     2019-05-07 05:00:00              NaN           50.4            16.0
4     2019-05-07 06:00:00              NaN           61.9             NaN
...                   ...              ...            ...             ...
1030  2019-06-20 22:00:00              NaN           21.4             NaN
1031  2019-06-20 23:00:00              NaN           24.9             NaN
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN

[1035 rows x 4 columns]>

In [26]:
air_quality["station_paris"].describe()

count    1004.000000
mean       27.740538
std        15.285746
min         0.000000
25%        16.500000
50%        24.150000
75%        35.925000
max        97.000000
Name: station_paris, dtype: float64

In [27]:
air_quality.isnull().sum()

datetime             0
station_antwerp    940
station_paris       31
station_london      66
dtype: int64

In [28]:
data = air_quality["station_london"].describe()
data

count    969.000000
mean      24.777090
std       11.214377
min        0.000000
25%       19.000000
50%       25.000000
75%       31.000000
max       97.000000
Name: station_london, dtype: float64